perf/bbox.yaml
config:
  environments:
    bbox_1:
      target: 'http://localhost:9090'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-1"
    bbox_2:
      target: 'http://localhost:9092'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-2"
    http:
      pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Simple
      duration: 60
      arrivalCount: 60

    - name: PlainSimple
      duration: 60
      arrivalRate: 60

    - name: RampSimple
      duration: 60
      arrivalRate: 60
      rampTo: 90

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'