perf/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Simple
      duration: 60
      arrivalRate: 15
    - name: Medium
      duration: 60
      arrivalRate: 30
    - name: Heavy
      duration: 60
      arrivalRate: 45

scenarios:
  - name: Heavy (/heavy)
    flow:
      - get:
          url: '/heavy'